/*
*******************************************************************************************************
*
* 文件名称 : eeprom.h
* 版    本 : V1.0
* 作    者 : mzy2364
* 说    明 : 24C02-EEPROM驱动文件
* 
*******************************************************************************************************
*/

#ifndef _EEPROM_H
#define _EEPROM_H

#ifdef __cplusplus
extern "C"{
#endif

/* 头文件 -----------------------------------------------------------*/
#include "gd32f30x.h"
#include "i2c.h"


/* 宏定义 -----------------------------------------------------------*/

/* 24C02-I2C地址 */
#define EEPROM_ADDRESS        0XA0

/* 24C02页大小 */
#define EEPROM_PAGESIZE       8



/* 全局变量 ----------------------------------------------------------*/


/* 函数声明 ----------------------------------------------------------*/
void eeprom_read(uint8_t mem_addr,uint8_t *pbuffer, uint16_t num_byte_to_read);
void eeprom_write(uint8_t mem_addr,uint8_t *pbuffer, uint16_t num_byte_to_write);

#ifdef __cplusplus
extern "C"{
#endif

#endif /* _EEPROM_H */

/***************************************** (END OF FILE) *********************************************/
